{"modelTopology":{"class_name":"Sequential","config":{"name":"sequential_30","layers":[{"class_name":"Dense","config":{"units":500,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense117","trainable":true,"batch_input_shape":[null,10000],"dtype":"float32"}},{"class_name":"Dense","config":{"units":250,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense118","trainable":true}},{"class_name":"Dense","config":{"units":100,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense119","trainable":true}},{"class_name":"Dense","config":{"units":26,"activation":"softmax","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense120","trainable":true}}]},"keras_version":"tfjs-layers 4.13.0","backend":"tensor_flow.js"},"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v4.13.0","convertedBy":null,"weightsManifest":[{"paths":["./TSmodel30.weights.bin"],"weights":[{"name":"dense_Dense117/kernel","shape":[10000,500],"dtype":"float32"},{"name":"dense_Dense117/bias","shape":[500],"dtype":"float32"},{"name":"dense_Dense118/kernel","shape":[500,250],"dtype":"float32"},{"name":"dense_Dense118/bias","shape":[250],"dtype":"float32"},{"name":"dense_Dense119/kernel","shape":[250,100],"dtype":"float32"},{"name":"dense_Dense119/bias","shape":[100],"dtype":"float32"},{"name":"dense_Dense120/kernel","shape":[100,26],"dtype":"float32"},{"name":"dense_Dense120/bias","shape":[26],"dtype":"float32"}]}]}